In [47]:
import pandas as pd

In [48]:
dept = pd.read_csv("departments.csv")
emp = pd.read_csv("full_employees.csv")

# data = [[1, 'Joe', 85000, 1], [2, 'Henry', 80000, 2], [3, 'Sam', 60000, 2], [4, 'Max', 90000, 1], [5, 'Janet', 69000, 1], [6, 'Randy', 85000, 1], [7, 'Will', 70000, 1]]
# employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'departmentId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'departmentId':'Int64'})
# data = [[1, 'IT'], [2, 'Sales']]
# department = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})

In [49]:
emp

       id     name  salary  departmentId
0     598   emnotw    1684            48
1     487   qorqse    2417             1
2     845   qkagqr    7676            17
3      71    prvfp     200            28
4     281    vwlqx    8700            18
..    ...      ...     ...           ...
116   153  ulqfclf    4612             2
117   714   vezugk    7485            25
118   567  qmftfrs    3138            47
119   136   cvzgom    1285            46
120  1000    nkscx    3508            29

[121 rows x 4 columns]

In [50]:
dept

    id      name
0   24     hvftu
1   17   otaargq
2   50   jvrquvn
3   37  rblmmvve
4   28  sjgfefob
5   22     mdtpq
6   38    trhjvi
7   26   yhpcwsu
8   47    royhhs
9   13    zbishb
10  41   epbqmxh
11   6    crscgx
12  48    phxosv
13  16  ctrkmenb
14  49  wlakrkax
15  46    gtyvlc
16   1  puzkjsqw
17   5    tfrtkb
18  34  ktoippcg
19  40  egqtdruc
20  11     morrp
21  30  rselwory
22   2   shlniie
23  43  xooaafce
24  33    qabltt
25  18  huvnpxch
26  31     tettg
27  32  mjywmeac
28   9   dikozuu
29   4   wvaaoul
30  36   ycepprp
31  42     gpety
32  20   tjgkkbu
33  35  lllfdztt
34  12    tsrzrf
35  14   leukmse
36  25   xbrcqpw
37  27  kzxjxgfi
38  15   gmdcmez
39  23     pkiee
40   8   nufqfmj
41  21   ksxddzm
42  10  gvoraoia
43   3   akmpbrm
44  44    eleqaz
45  19  yqvubdno
46  29     tszyb
47   7   uzjigpy
48  45    wngafc
49  39    juvqlp

In [51]:
df = pd.merge(emp, dept, left_on='departmentId', right_on='id', suffixes=('_emp', '_dept'))

In [52]:
df

     id_emp name_emp  salary  departmentId  id_dept name_dept
0       598   emnotw    1684            48       48    phxosv
1       487   qorqse    2417             1        1  puzkjsqw
2       845   qkagqr    7676            17       17   otaargq
3        71    prvfp     200            28       28  sjgfefob
4       281    vwlqx    8700            18       18  huvnpxch
..      ...      ...     ...           ...      ...       ...
116     153  ulqfclf    4612             2        2   shlniie
117     714   vezugk    7485            25       25   xbrcqpw
118     567  qmftfrs    3138            47       47    royhhs
119     136   cvzgom    1285            46       46    gtyvlc
120    1000    nkscx    3508            29       29     tszyb

[121 rows x 6 columns]

In [53]:
df2 = df.drop_duplicates(subset=['salary','name_dept'])
df2

     id_emp name_emp  salary  departmentId  id_dept name_dept
0       598   emnotw    1684            48       48    phxosv
1       487   qorqse    2417             1        1  puzkjsqw
2       845   qkagqr    7676            17       17   otaargq
3        71    prvfp     200            28       28  sjgfefob
4       281    vwlqx    8700            18       18  huvnpxch
..      ...      ...     ...           ...      ...       ...
116     153  ulqfclf    4612             2        2   shlniie
117     714   vezugk    7485            25       25   xbrcqpw
118     567  qmftfrs    3138            47       47    royhhs
119     136   cvzgom    1285            46       46    gtyvlc
120    1000    nkscx    3508            29       29     tszyb

[121 rows x 6 columns]

In [54]:
top_3 = df2.groupby('name_dept')['salary'].nlargest(3).reset_index()

In [55]:
top_3

   name_dept  level_1  salary
0    akmpbrm       26    8109
1    akmpbrm       15    4248
2    akmpbrm       25    2990
3     crscgx      113    9115
4     crscgx       84    6528
..       ...      ...     ...
95  yqvubdno       73    4447
96  yqvubdno       62    3956
97    zbishb        8    8145
98    zbishb       28    5588
99    zbishb       95    2689

[100 rows x 3 columns]

In [56]:
df = pd.merge(df, top_3, on=['name_dept', 'salary'])

In [57]:
df.rename(columns={'name_dept': 'Department','name_emp': 'Employee','salary': 'Salary'})[['Department', 'Employee', 'Salary']]

   Department Employee  Salary
0      phxosv   emnotw    1684
1    puzkjsqw   qorqse    2417
2     otaargq   qkagqr    7676
3    sjgfefob    prvfp     200
4    huvnpxch    vwlqx    8700
..        ...      ...     ...
95    shlniie  ulqfclf    4612
96    xbrcqpw   vezugk    7485
97     royhhs  qmftfrs    3138
98     gtyvlc   cvzgom    1285
99      tszyb    nkscx    3508

[100 rows x 3 columns]